stress-test.yml
config:
  target: http://localhost:3000
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  plugins:
    fake-data: {}
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - get:
              url: '/'
        count: 100
      - post:
          url: '/users'
          capture:
            - json: '$.id'
              as: 'userId'
            - json: '$.username'
              as: 'username'
          json:
            username: '{{ $randUserName() }}'
      - post:
          url: '/groups'
          capture:
            - json: '$.id'
              as: 'groupId'
          json:
            title: '{{ $randUserName() }}'
      - post:
          url: '/items'
          capture:
            - json: '$.id'
              as: 'itemAId'
          json:
            title: '{{ $randUserName() }}'
      - post:
          url: '/items'
          capture:
            - json: '$.id'
              as: 'itemBId'
          json:
            title: '{{ $randUserName() }}'
      - post:
          url: '/{{ groupId }}/users/{{ userId }}'
      - post:
          url: '/{{ groupId }}/items/{{ itemAId }}'
      - post:
          url: '/{{ groupId }}/users/{{ itemBId }}'
      - get:
          url: '/items?username={{ username }}'